// import './AboutUs.css';

const AboutUs = () => {
  return (
    <div className='about-us'>
      <h3>О нас</h3>
      <div className='flex'>
        <div className='orangeLine'></div>
        <div>
          <p className='p'>Мы рады видеть вас! Мы работаем для Вас с 2003 года. 14 лет мы наблюдаем, как с каждым 
        днем все больше людей заказывают жд билеты через интернет.</p>
        <p> </p>
        <p className='p'>Сегодня можно заказать железнодорожные билеты онлайн всего в 2 клика, но стоит ли это делать?</p>
        <p className='p'>Мы расскажем о преимуществах заказа через интернет.</p>
        <p> </p>
        <p className='p'>
          <strong>
            Покупать жд билеты дешево можно за 90 суток до отправления поезда. Благодаря динамическому ценообразованию цена на билеты в это время самая низкая.
          </strong>
        </p></div>
      </div>
    </div>
  );
};

export default AboutUs;